-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.5.8-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.0.0.5919
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- recycle_allimi 데이터베이스 구조 내보내기
DROP DATABASE IF EXISTS `recycle_allimi`;
CREATE DATABASE IF NOT EXISTS `recycle_allimi` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `recycle_allimi`;

-- 테이블 recycle_allimi.main 구조 내보내기
DROP TABLE IF EXISTS `main`;
CREATE TABLE IF NOT EXISTS `main` (
  `class` varchar(200) NOT NULL,
  `item` varchar(200) NOT NULL,
  `isPossible` int(11) NOT NULL DEFAULT 0,
  `explain` text NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=euckr;

-- 테이블 데이터 recycle_allimi.main:~123 rows (대략적) 내보내기
/*!40000 ALTER TABLE `main` DISABLE KEYS */;
INSERT INTO `main` (`class`, `item`, `isPossible`, `explain`) VALUES
	('종이류', '신문지', 1, '종이류'),
	('종이류', '책자, 노트, 전단지, 쇼핑백, 달력, 포장지 등', 1, '종이류'),
	('종이류', '상자류(종이 박스, 기타 골판지 상자 등)', 1, '종이류'),
	('종이류', '종이 조각, 각종 영수증, 고지서', 1, '종이류. 단, 개인정보가 포함되어 있는 영수증과 고지서는 개인정보 식별이 불가능하도록 유의해서 배출'),
	('종이류', '종이 핸드타월', 0, '이물질이 묻어있을 경우 재활용이 안되므로 일반 종량제 봉투에 버려야함'),
	('종이류', '휴지', 0, '일반 종량제 봉투'),
	('종이류', '코팅된 종이(광고지, 전단지, 사진 등)', 0, '일반 종량제 봉투'),
	('종이류', '스프링 등(철, 플라스틱) 제본된 책자류', 1, '스프링 및 비닐 표지는 가급적 제거 후 종이류로 배출'),
	('종이컵, 종이팩', '종이컵', 1, '종이컵'),
	('종이컵, 종이팩', '종이팩', 1, '종이팩'),
	('캔류, 고철류', '철캔, 알루미늄캔', 1, '캔류'),
	('캔류, 고철류', '기타 캔류(부탄가스 용기, 살충제 용기 등)', 1, '캔류. 구멍을 뚫어 남은 가스를 비운 후 배출'),
	('캔류, 고철류', '우산', 0, '가급적 재질별로 분리해서 철은 고철로 나머지는 일반 종량제 봉투에 넣어 배출. 재질별로 분리가 어려운 경우는 고철류로 배출'),
	('캔류, 고철류', '고철(공구류, 철사, 못, 전선, 알루미늄, 스텐 등)', 1, '고철류'),
	('유리병류', '음료수 병, 기타 병류', 1, '유리병류'),
	('유리병류', '깨진 유리', 0, '소량의 경우 일반 종량제봉투가 찢어지지 않도록 신문지에 싸서 배출. 깨진 유리의 양이 많을 경우 특수규격마대(불연물질)를 구매하여 배출 '),
	('유리병류', '일반 유리제품(유리잔 또는 맥주컵 등)', 0, '일반 유리잔이나 맥주컵은 유리류로 배출. 단, 내열유리는 특수마대(불연물질)를 구매하여 배출. 특수규격마대 구입처 : 구 지정 판매처 (동주민센터, 편의점 등). 내열유리의 종류 : 전자레인지 혹은 가스레인지용 유리 용기'),
	('플라스틱', '페트병, 플라스틱 용기류', 1, '플라스틱류로 배출'),
	('플라스틱', '폐스티로폼', 1, '플라스틱류로 배출'),
	('플라스틱', '고무대야', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', 'CD', 1, '플라스틱류로 배출'),
	('플라스틱', '비디오/오디오테이프', 0, '케이스는 플라스틱류, 내부 필름 재활용X. 분리 어려우면 플라스틱 재활용품으로 배출'),
	('플라스틱', '화분', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', '유아용 볼풀공', 1, '플라스틱류로 배출'),
	('플라스틱', '완구류', 1, '재질별로 분리 후 재활용품으로 배출 '),
	('플라스틱', '송곳', 1, '고철류로 배출'),
	('플라스틱', '노끈', 0, '딱딱한 노끈은 플라스틱, 부드러운 노끈은 비닐류로 배출'),
	('플라스틱', '알약 포장재', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', '부서진 스티로폼 조각', 1, '플라스틱류로 배출'),
	('플라스틱', '1회용 그릇', 1, '재질별로 분리 후 재활용품으로 배출'),
	('비닐류', '과자, 라면, 빵 봉지 등 모든 비닐', 1, '비닐류로 배출'),
	('비닐류', '뽁뽁이', 1, '비닐류로 배출'),
	('형광등', '형광등', 1, '폐형광등 전용수거함에 배출'),
	('형광등', '깨진 형광등', 0, '일반 종량제 봉투로 배출'),
	('형광등', '백열전구', 0, '일반 종량제 봉투로 배출'),
	('형광등', 'LED전구', 0, '일반 종량제 봉투로 배출'),
	('건전지', '건전지, 충전용 전지', 1, '주요거점(동주민센터/아파트의 폐형광등/폐전지 일체함 또는 편의점, 아파트 동별 우편함 등)의 전용수거함에 배출'),
	('섬유류', '헌옷', 1, '의류수거함에 배출'),
	('섬유류', '신발', 1, '의류수거함에 배출'),
	('섬유류', '가방', 1, '의류수거함에 배출'),
	('섬유류', '담요', 1, '의류수거함에 배출'),
	('섬유류', '누비이불', 1, '의류수거함에 배출'),
	('섬유류', '커튼', 1, '의류수거함에 배출'),
	('섬유류', '수건', 0, '일반 종량제 봉투'),
	('섬유류', '배게', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '방석', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '롤러스케이트', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '걸레', 0, '일반 종량제 봉투'),
	('섬유류', '솜이불', 0, '대형폐기물로 신고 후 수수료를 납부하고 버려야 함. (소량인 경우 종량제 봉투에 담아 버려야 함) ※규격에 따른 수수료는 구청 홈페이지 참고'),
	('전자제품', '소형폐가전 (컴퓨터, 전기밥솥, 선풍기 등 1m 미만 가전제품)\r\n', 1, '재활용품과 함께 배출. 동주민센터 및 아파트 내 비치된 전용수거함으로 배출.\r\n'),
	('전자제품', '전기 방석\r\n', 0, '일반 종량제 봉투, 어려운 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고\r\n'),
	('전자제품', '전기 담요', 0, '일반 종량제 봉투, 어려운 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고'),
	('전자제품', '대형폐가전 (세탁기, 에어컨, 냉장고, TV 등 1m 이상 가전제품)\r\n', 1, '대형폐가전 무상방문수거 서비스 이용'),
	('폐식용유', '폐식용유', 1, '음식물 등 이물질이 섞이지 않게 모아 가까운 곳에 설치된 폐유수거함(동주민센터, 일부 아파트 등)에 배출\r\n'),
	('기타\r\n', '폐목재류\r\n', 0, '일반 가정에서 나오는 소량은 종량제 봉투. 다량의 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고\r\n'),
	('기타\r\n', '아이스팩\r\n', 0, '뜯지 말고 그대로 일반 종량제 쓰레기 봉투에 넣어 배출\r\n'),
	('기타', '양초', 0, '일반 종량제 봉투\r\n'),
	('기타\r\n', '스펀지\r\n', 0, '일반 종량제 봉투\r\n'),
	('기타\r\n', '폐의약품\r\n', 0, '가까운 약국으로 가져가 사용가능한 의약품은 약사의 복약지도를 받고 사용 불가능한 의약품은 보건소와 구청에서 안전하게 회수하여 폐기함\r\n'),
	('기타\r\n', '페인트통', 0, '남은 페인트를 굳혀 특수규격마대(불연물질)를 구매 후 배출 ※특수규격마대 구입처: 구 지정 판매처(동주민센터, 편의점 등)'),
	('기타', '연탄재\r\n', 0, '투명비닐봉투에 담아 배출\r\n'),
	('종이류', '신문지', 1, '종이류'),
	('종이류', '책자, 노트, 전단지, 쇼핑백, 달력, 포장지 등', 1, '종이류'),
	('종이류', '상자류(종이 박스, 기타 골판지 상자 등)', 1, '종이류'),
	('종이류', '종이 조각, 각종 영수증, 고지서', 1, '종이류. 단, 개인정보가 포함되어 있는 영수증과 고지서는 개인정보 식별이 불가능하도록 유의해서 배출'),
	('종이류', '종이 핸드타월', 0, '이물질이 묻어있을 경우 재활용이 안되므로 일반 종량제 봉투에 버려야함'),
	('종이류', '휴지', 0, '일반 종량제 봉투'),
	('종이류', '코팅된 종이(광고지, 전단지, 사진 등)', 0, '일반 종량제 봉투'),
	('종이류', '스프링 등(철, 플라스틱) 제본된 책자류', 1, '스프링 및 비닐 표지는 가급적 제거 후 종이류로 배출'),
	('종이컵, 종이팩', '종이컵', 1, '종이컵'),
	('종이컵, 종이팩', '종이팩', 1, '종이팩'),
	('캔류, 고철류', '철캔, 알루미늄캔', 1, '캔류'),
	('캔류, 고철류', '기타 캔류(부탄가스 용기, 살충제 용기 등)', 1, '캔류. 구멍을 뚫어 남은 가스를 비운 후 배출'),
	('캔류, 고철류', '우산', 0, '가급적 재질별로 분리해서 철은 고철로 나머지는 일반 종량제 봉투에 넣어 배출. 재질별로 분리가 어려운 경우는 고철류로 배출'),
	('캔류, 고철류', '고철(공구류, 철사, 못, 전선, 알루미늄, 스텐 등)', 1, '고철류'),
	('유리병류', '음료수 병, 기타 병류', 1, '유리병류'),
	('유리병류', '깨진 유리', 0, '소량의 경우 일반 종량제봉투가 찢어지지 않도록 신문지에 싸서 배출. 깨진 유리의 양이 많을 경우 특수규격마대(불연물질)를 구매하여 배출 '),
	('유리병류', '일반 유리제품(유리잔 또는 맥주컵 등)', 0, '일반 유리잔이나 맥주컵은 유리류로 배출. 단, 내열유리는 특수마대(불연물질)를 구매하여 배출. 특수규격마대 구입처 : 구 지정 판매처 (동주민센터, 편의점 등). 내열유리의 종류 : 전자레인지 혹은 가스레인지용 유리 용기'),
	('플라스틱', '페트병, 플라스틱 용기류', 1, '플라스틱류로 배출'),
	('플라스틱', '폐스티로폼', 1, '플라스틱류로 배출'),
	('플라스틱', '고무대야', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', 'CD', 1, '플라스틱류로 배출'),
	('플라스틱', '비디오/오디오테이프', 0, '케이스는 플라스틱류, 내부 필름 재활용X. 분리 어려우면 플라스틱 재활용품으로 배출'),
	('플라스틱', '화분', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', '유아용 볼풀공', 1, '플라스틱류로 배출'),
	('플라스틱', '완구류', 1, '재질별로 분리 후 재활용품으로 배출 '),
	('플라스틱', '송곳', 1, '고철류로 배출'),
	('플라스틱', '노끈', 0, '딱딱한 노끈은 플라스틱, 부드러운 노끈은 비닐류로 배출'),
	('플라스틱', '알약 포장재', 0, '일반 종량제 봉투로 배출'),
	('플라스틱', '부서진 스티로폼 조각', 1, '플라스틱류로 배출'),
	('플라스틱', '1회용 그릇', 1, '재질별로 분리 후 재활용품으로 배출'),
	('비닐류', '과자, 라면, 빵 봉지 등 모든 비닐', 1, '비닐류로 배출'),
	('비닐류', '뽁뽁이', 1, '비닐류로 배출'),
	('형광등', '형광등', 1, '폐형광등 전용수거함에 배출'),
	('형광등', '깨진 형광등', 0, '일반 종량제 봉투로 배출'),
	('형광등', '백열전구', 0, '일반 종량제 봉투로 배출'),
	('형광등', 'LED전구', 0, '일반 종량제 봉투로 배출'),
	('건전지', '건전지, 충전용 전지', 1, '주요거점(동주민센터/아파트의 폐형광등/폐전지 일체함 또는 편의점, 아파트 동별 우편함 등)의 전용수거함에 배출'),
	('섬유류', '헌옷', 1, '의류수거함에 배출'),
	('섬유류', '신발', 1, '의류수거함에 배출'),
	('섬유류', '가방', 1, '의류수거함에 배출'),
	('섬유류', '담요', 1, '의류수거함에 배출'),
	('섬유류', '누비이불', 1, '의류수거함에 배출'),
	('섬유류', '커튼', 1, '의류수거함에 배출'),
	('섬유류', '카페트', 1, '의류수거함에 배출'),
	('섬유류', '수건', 0, '일반 종량제 봉투'),
	('섬유류', '배게', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '방석', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '롤러스케이트', 1, '투명 봉투에 담아 재활용품으로 배출'),
	('섬유류', '걸레', 0, '일반 종량제 봉투'),
	('섬유류', '솜이불', 0, '대형폐기물로 신고 후 수수료를 납부하고 버려야 함. (소량인 경우 종량제 봉투에 담아 버려야 함) ※규격에 따른 수수료는 구청 홈페이지 참고'),
	('전자제품', '소형폐가전 (컴퓨터, 전기밥솥, 선풍기 등 1m 미만 가전제품)\r\n', 1, '재활용품과 함께 배출. 동주민센터 및 아파트 내 비치된 전용수거함으로 배출.\r\n'),
	('전자제품', '전기 방석\r\n', 0, '일반 종량제 봉투, 어려운 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고\r\n'),
	('전자제품', '전기 담요', 0, '일반 종량제 봉투, 어려운 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고'),
	('전자제품', '대형폐가전 (세탁기, 에어컨, 냉장고, TV 등 1m 이상 가전제품)\r\n', 1, '대형폐가전 무상방문수거 서비스 이용'),
	('폐식용유', '폐식용유', 1, '음식물 등 이물질이 섞이지 않게 모아 가까운 곳에 설치된 폐유수거함(동주민센터, 일부 아파트 등)에 배출\r\n'),
	('기타\r\n', '폐목재류\r\n', 0, '일반 가정에서 나오는 소량은 종량제 봉투. 다량의 경우 대형폐기물로 신고 후 수수료 내고 배출 ※규격에 따른 수수료는 구청 홈페이지 참고\r\n'),
	('기타\r\n', '아이스팩\r\n', 0, '뜯지 말고 그대로 일반 종량제 쓰레기 봉투에 넣어 배출\r\n'),
	('기타', '양초', 0, '일반 종량제 봉투\r\n'),
	('기타\r\n', '스펀지\r\n', 0, '일반 종량제 봉투\r\n'),
	('기타\r\n', '폐의약품\r\n', 0, '가까운 약국으로 가져가 사용가능한 의약품은 약사의 복약지도를 받고 사용 불가능한 의약품은 보건소와 구청에서 안전하게 회수하여 폐기함\r\n'),
	('기타\r\n', '페인트통', 0, '남은 페인트를 굳혀 특수규격마대(불연물질)를 구매 후 배출 ※특수규격마대 구입처: 구 지정 판매처(동주민센터, 편의점 등)'),
	('기타', '연탄재\r\n', 0, '투명비닐봉투에 담아 배출\r\n');
/*!40000 ALTER TABLE `main` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
